RUN_STRINGS = (
    "Huh? what? did they get away?",
    "Now you see me, now you don't."
    "ε=ε=ε=ε=┌(;￣▽￣)┘",
    "Get back here!",
    "REEEEEEEEEEEEEEEEEE!!!!!!!",
    "Look out for the wall!",
    "Don't leave me alone with them!!",
    "You've got company!",
    "Chotto matte!", # How about two Japanese?
    "Yare yare daze",
    "*Naruto run activated*",
    "*Nezuko run activated*",
    "Hey take responsibilty for what you just did!",
    "May the odds be ever in your favour.",
    "Run everyone, they just dropped a bomb 💣💣",
    "And they disappeared forever, never to be seen again.",
    "Legend has it, they're still running.",
    "Hasta la vista, baby.",
    "Ah, what a waste. I liked that one.",
    "As The Doctor would say... RUN!",
)

DARK_STRINGS = (
    "പ്ഫാ പന്ന പരനാറി 😠 🤬",
    "നിന്റെ കുഞ്ഞമ്മേടെ നായർ 😤 🤫",
    "നീ വല്ല്യ മലരൻ ആണല്ലോടാ..  🤬 🤨",
    "പ്ഫാ ഇറങ്ങി പോടാ നാറി 🤨",
    "കടക്കു പുറത്ത് 😕",
    "ഗ്രൂപ്പിൽ നിന്ന് ഇറങ്ങി പോടാ നാറി 😠 🤬",
    "പ്ഫാ പന്ന പട്ടി 🥴🥴",
    "നീ ഏതാടാ ഊളേ 🙄",
    "പോടാ പട്ടി",
    "ഡാ പന്നി ",
    "പുന്നാര മോനെ",
    "പോടാ മാക്രി",
    "പോടാ നാറി",
    "വാടാ ... പട്ടീ",
    "പോയി ചാവടാ 🤬",
    "നീ പോടാ കാട്ടുകോഴി 🤨",
    "പോയി ചത്തൂടെ നിനക്ക്",
    "കോപ്പേ വല്യ ബഹളം വേണ്ട 😠",
    "വല്യ മലരനാണല്ലോടാ നീ 🤨",
    "മണ്ണുണ്ണി",
    "ഡാ പന്നക്കിളവ",
    " നിന്റെ കുഞ്ഞമ്മേടെ നായർ",
    "നിന്റെ അപ്പൂപ്പനോട്‌ പോയി പറ",
    "പോ മലരേ"
)

SLAP_SAITAMA_TEMPLATES = (
    "എന്നെ സ്ലാപ്പ് ചെയ്യാൻ തക്കം നീ വളർന്നോ..?  🥴",
    "കണ്ട ഊള ബോട്ടുകളെ സ്ലാപ് ചെയുന്ന പോലെ എനിക്കിട്ട് ഉണ്ടാക്കല്ലേ അരിഞ്ഞു കളയും ഞാൻ പന്നി 😏 ",
    [
        "പോയിട്ട് പിന്നെ വാ മോനെ 😌",  # normal reply
        "എന്തിനാ പ്പോ എനിക്കിട്ട് കൊട്ടുന്നെ 😒",  # reply to admin
        "tmute"  # command
    ]
)


SLAP_MASTER_TEMPLATES = (
    "അവൻ എന്റെ മാസ്റ്റർ ആണ് തൊട്ടാൽ കൈ ഞാൻ വെട്ടും 🤬",
    "ഓട്രാ ചള്ള് ചെക്കാ. ഇമ്മടെ പിള്ളാരെ തൊടാൻ നീ ആയിട്ടില്ല. ‼️",
    [
        "I am muting you for a minute.",  # normal reply
        "ന്യയോ. 😶",  # reply to admin
        "tmute"  # command
    ]
)


SLAP_ABHI_TEMPLATES = (
    "കൊച്ചിനെ തൊടണേൽ നീ ഒന്നുടെ ജനിക്കണം 👀",
    "അവളെ തൊടാൻ നീ ആയിട്ടില്ല മോനുസേ പോയിട്ട് പിന്നെ വാ 🤨",
    "ഇനി അവളെ സ്ലാപ് ചെയ്യാൻ നിന്നാൽ പൊന്നു മോനെ ഔസേപ്പേ നിന്നെ mute ആക്കി വിടും ഞാൻ 🤫🤫 ", 
    "ടാ ഇമ്മടെ കൊച്ചിനെ സ്ലാപ്പുന്നോ കാലേ വാരി നിലത്തടിക്കും ഞാൻ 🤨🤨", 
    [
        "I am muting you for a minute.",  # normal reply
        "Nyoo.. 😑",  # reply to admin
        "tmute"  # command
    ]
)


SLAP_KANNAN_TEMPLATES = (
    "ഞങ്ങടെ കണ്ണപ്പനെ സ്ലാപ് ചെയ്യാൻ നീ ആരാടാ ഊള ചെക്കാ..?  🤭🤭",
    "അവന്റെ രോമത്തിൽ തൊടാൻ പറ്റില്ല നിനക്കൊന്നും 🤨🤨",
    "നീയല്ല നിന്റെ മുത്തച്ഛൻ വിചാരിച്ചാൽ പോലും ചെക്കനെ സ്ലാപ് ചെയ്യാൻ പറ്റില്ല", 

    [
        "I am muting you for a minute.",  # normal reply
        "ചെക്കനെ സ്ലാപ്പ് ചെയ്യാൻ സമ്മതിക്കില്ല 😶",  # reply to admin
        "tmute"  # command
    ]
)

SLAP_TEMPLATES = (
    "{user1} {user2} ന്റെ ചെവിക്കല് അടിച്ചു പൊളിച്ചു 😐😔",
"{user1} {user2} ന്റെ മുഖത്തു തിളച്ച എണ്ണ എടുത്ത് ഒഴിച്ചു  😵🥴",
"{user1} {user2} നെ കാലേ വാരി നിലത്തടിച്ചു 🤓☹️ ",
"{user1} {user2} ന്റെ ചെവിക്ക് പിടിച്ചു തൂക്കി എറിഞ്ഞു 🥴🥴",
"{user1} ഓടി വന്നു {user2} നെ ചവിട്ടി നിലത്ത്  ഇട്ട് രണ്ട് ചവിട്ട് കൊടുത്തു 😳😳  ",
"{user1} {user2} ന്റെ കുണ്ടിക്ക് ചട്ടുകം പഴുപ്പിച്ചു വച്ചു 🤯🤯 ",
"{user1} {user2} ന്റെ മുഖത്തു ചാണകം കലക്കി ഒഴിച്ചു 💩💩",
"{user1} ഓടി വന്നു  {user2} ന്റെ ചന്തിക്കു ചൂരല് കൊണ്ട് 5, 6 അടി കൊടുത്തു 😧😧  ",
"{user1} {user2} നെ എടുത്ത് പൊട്ട കിണറ്റിൽ ഇട്ടു 🤣🤣",
"{user1} {user2} ന്റെ തലക്കിട്ടു പാറ കല്ലിനു എറിഞ്ഞു 🥺🥺 ",
"{user1} {user2} നെ കുനിച്ചു നിർത്തി കൂമ്പിനിടിച്ചു 🤭🤣🤣  ",
"{user1} ഒരു കയർ എടുത്ത് {user2} നെ  മരത്തിൽ കെട്ടി ഇട്ട് ചീ മുട്ട കൊണ്ട് എറിഞ്ഞു 😁😁 ",
"{user1} {user2} ന്റെ തലക്കിട്ടു അഞ്ചാറു അടി കൊടുത്തു 😪😪 ",
"{user1} ഓടി വന്നു {user2} നെ ചവിട്ടി  കുളത്തിൽ ഇട്ടു 🤭🤭  ",
"{user1} {user2} ന്റെ തല അടിച്ചു പൊളിച്ചു 🤥🤥 ",
"{user1} ഓടി വന്നു {user2} നെ പിടിച്ചു  മോന്ത നോക്കി അഞ്ചാറു അടി കൊടുത്തു 🤪🤪 ",
"{user1} {user2} നെ  ചവിട്ടി നിലത്തിട്ട് വലിച്ചോണ്ട് പോയി 🤭🤭 ",
"{user1} ചാണകം വാരി {user2} മോന്തക്ക് എറിഞ്ഞു 🤢🤮 ",

)

PING_STRING = (
    "PONG!!",
    "I am here!",
)

ITEMS = (
    "cast iron skillet",
    "angry meow",
    "cricket bat",
    "wooden cane",
    "shovel",
    "toaster",
    "book",
    "laptop",
    "rubber chicken",
    "spiked bat",
    "heavy rock",
    "chunk of dirt",
    "ton of bricks",
    "rasengan",
    "spirit bomb",
    "100-Type Guanyin Bodhisattva",
    "rasenshuriken",
    "Murasame",
    "ban",
    "chunchunmaru",
    "Kubikiribōchō",
    "rasengan",
    "spherical flying kat",
)

THROW = (
    "throws",
    "flings",
    "chucks",
    "hurls",
)

HIT = (
    "hits",
    "whacks",
    "slaps",
    "smacks",
    "bashes",
    "pats",

)

EYES = [
    ['⌐■', '■'],
    [' ͠°', ' °'],
    ['⇀', '↼'],
    ['´• ', ' •`'],
    ['´', '`'],
    ['`', '´'],
    ['ó', 'ò'],
    ['ò', 'ó'],
    ['⸌', '⸍'],
    ['>', '<'],
    ['Ƹ̵̡', 'Ʒ'],
    ['ᗒ', 'ᗕ'],
    ['⟃', '⟄'],
    ['⪧', '⪦'],
    ['⪦', '⪧'],
    ['⪩', '⪨'],
    ['⪨', '⪩'],
    ['⪰', '⪯'],
    ['⫑', '⫒'],
    ['⨴', '⨵'],
    ['⩿', '⪀'],
    ['⩾', '⩽'],
    ['⩺', '⩹'],
    ['⩹', '⩺'],
    ['◥▶', '◀◤'],
    ['◍', '◎'],
    ['/͠-', '┐͡-\\'],
    ['⌣', '⌣”'],
    [' ͡⎚', ' ͡⎚'],
    ['≋'],
    ['૦ઁ'],
    ['  ͯ'],
    ['  ͌'],
    ['ළ'],
    ['◉'],
    ['☉'],
    ['・'],
    ['▰'],
    ['ᵔ'],
    [' ﾟ'],
    ['□'],
    ['☼'],
    ['*'],
    ['`'],
    ['⚆'],
    ['⊜'],
    ['>'],
    ['❍'],
    ['￣'],
    ['─'],
    ['✿'],
    ['•'],
    ['T'],
    ['^'],
    ['ⱺ'],
    ['@'],
    ['ȍ'],
    ['  '],
    ['  '],
    ['x'],
    ['-'],
    ['$'],
    ['Ȍ'],
    ['ʘ'],
    ['Ꝋ'],
    [''],
    ['⸟'],
    ['๏'],
    ['ⴲ'],
    ['◕'],
    ['◔'],
    ['✧'],
    ['■'],
    ['♥'],
    [' ͡°'],
    ['¬'],
    [' º '],
    ['⨶'],
    ['⨱'],
    ['⏓'],
    ['⏒'],
    ['⍜'],
    ['⍤'],
    ['ᚖ'],
    ['ᴗ'],
    ['ಠ'],
    ['σ'],
    ['☯']
]

MOUTHS = [
    ['v'],
    ['ᴥ'],
    ['ᗝ'],
    ['Ѡ'],
    ['ᗜ'],
    ['Ꮂ'],
    ['ᨓ'],
    ['ᨎ'],
    ['ヮ'],
    ['╭͜ʖ╮'],
    [' ͟ل͜'],
    [' ͜ʖ'],
    [' ͟ʖ'],
    [' ʖ̯'],
    ['ω'],
    [' ³'],
    [' ε '],
    ['﹏'],
    ['□'],
    ['ل͜'],
    ['‿'],
    ['╭╮'],
    ['‿‿'],
    ['▾'],
    ['‸'],
    ['Д'],
    ['∀'],
    ['!'],
    ['人'],
    ['.'],
    ['ロ'],
    ['_'],
    ['෴'],
    ['ѽ'],
    ['ഌ'],
    ['⏠'],
    ['⏏'],
    ['⍊'],
    ['⍘'],
    ['ツ'],
    ['益'],
    ['╭∩╮'],
    ['Ĺ̯'],
    ['◡'],
    [' ͜つ']
]

EARS = [
    ['q', 'p'],
    ['ʢ', 'ʡ'],
    ['⸮', '?'],
    ['ʕ', 'ʔ'],
    ['ᖗ', 'ᖘ'],
    ['ᕦ', 'ᕥ'],
    ['ᕦ(', ')ᕥ'],
    ['ᕙ(', ')ᕗ'],
    ['ᘳ', 'ᘰ'],
    ['ᕮ', 'ᕭ'],
    ['ᕳ', 'ᕲ'],
    ['(', ')'],
    ['[', ']'],
    ['¯\\_', '_/¯'],
    ['୧', '୨'],
    ['୨', '୧'],
    ['⤜(', ')⤏'],
    ['☞', '☞'],
    ['ᑫ', 'ᑷ'],
    ['ᑴ', 'ᑷ'],
    ['ヽ(', ')ﾉ'],
    ['\\(', ')/'],
    ['乁(', ')ㄏ'],
    ['└[', ']┘'],
    ['(づ', ')づ'],
    ['(ง', ')ง'],
    ['⎝', '⎠'],
    ['ლ(', 'ლ)'],
    ['ᕕ(', ')ᕗ'],
    ['(∩', ')⊃━☆ﾟ.*'],
]

TOSS = (
    "Heads",
    "Tails",
)

DECIDE = (
    "Yes.",
    "No.",
    "Maybe."
)

TABLE = (
    "(╯°□°）╯彡 ┻━┻",
    "I ran out of tables, will order more.",
    "Go do some work instead of flippin tables."
)
